@php /** @var App\Entities\Shop\Category[] $categories */ @endphp
@extends('layouts.index')
@section('breadcrumbs', '')
@section('content')
    <section id="main_banner">
        <div class="back-first"></div>
        <div class="back-second"></div>
        <div class="back-third"></div>
        <div class="banner-container">
            <div class="banner-head text-center text-white">
                <h1 class="m-0">Обои для стен</h1>
                <span>Отгружаем обои от 1 рулона и покоробочно</span>
            </div>
            <x-menu handler="bannerMenu" template="components.banner" />
        </div>
    </section>
    <section class="interior-paint">
        <div class="container">
            <div class="row">
                <div class="col-5">
                    <h2>Интерьерная краска</h2>
                    <p><strong>Обои Центр</strong> - интерьерные краски, вдохновленные природными мотивами и традиционной атмосферой скандинавского уюта, с авторской палитрой цветов. Экологичные и безопасные краски HYGGE Paint высокого класса истираемости можно мыть с применением мыльных растворов. Изготавливают краски на водной основе, с использованием мраморной крошки, что дает краскам долговечность и непревзойденную глубину цвета. Безупречная рецептура с добавками против плесени и грибка, позволяет использовать краски HYGGE Paint во всех типах помещений</p>
                </div>
                <div class="col-7">
                    <img src="{{ asset('storage/files/home-page/interior-paint.webp') }}" alt="Интерьерная краска HYGGE Paint">
                </div>
            </div>
        </div>
    </section>
    @if(isset($newCollections) and !$newCollections->isEmpty())
        <section class="new-collections">
            @php $count = 0 @endphp
            @foreach($newCollections as $collection)
                @if($collection->getMainImage('medium', 3))
                    @php $count ++ @endphp
                @endif
            @endforeach

            <h2 class="text-center">{{ ru_plural($count, ['Новая коллекция', 'Новые коллекции', 'Новых коллекций']) }}</h2>

            <div class="carousel swiper">
                <div class="swiper-wrapper">
                @php /** @var App\Entities\Shop\Category $collection */ @endphp
                    @foreach($newCollections as $collection)
                        @if($collection->getMainImage('medium', 3))
                            <div class="item-wrapper swiper-slide">
                                <div class="carousel-item">
                                    <div class="icon-new">
                                        <img src="{{ asset('/storage/files/home-page/new.webp') }}" alt="Иконка новинки">
                                    </div>
                                    <img src="{{ $collection->getMainImage('medium', 3) }}" alt="Коллекция обоев: {{ $collection->name }}">
                                </div>
                                <p><span>коллекция</span><a href="#">{{ $collection->name }}</a></p>
                            </div>
                        @endif
                    @endforeach
                </div>
                <div class="swiper-button swiper-button-next">
                    <svg width="21" height="30" viewBox="0 0 21 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M1 29L19 15.8235L1 0.999998" stroke="white" stroke-width="2"/>
                    </svg>
                </div>
                <div class="swiper-button swiper-button-prev">
                    <svg width="21" height="30" viewBox="0 0 21 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M20 1L2 14.1765L20 29" stroke="white" stroke-width="2"/>
                    </svg>
                </div>
            </div>
            <div class="d-flex justify-content-center align-items-center pt-5">
                <a href="#" class="all-collections btn btn-outline-dark text-uppercase">
                    Все коллекции
                    <svg xmlns="http://www.w3.org/2000/svg" width="38" height="9" viewBox="0 0 38 9" fill="none">
                        <path d="M37.3536 4.85355C37.5488 4.65829 37.5488 4.34171 37.3536 4.14645L34.1716 0.964466C33.9763 0.769204 33.6597 0.769204 33.4645 0.964466C33.2692 1.15973 33.2692 1.47631 33.4645 1.67157L36.2929 4.5L33.4645 7.32843C33.2692 7.52369 33.2692 7.84027 33.4645 8.03553C33.6597 8.2308 33.9763 8.2308 34.1716 8.03553L37.3536 4.85355ZM0 5H37V4H0V5Z" fill="black"/>
                    </svg>
                </a>
            </div>
        </section>
    @endif
    <section class="company-info">
        <div class="container">
            <div class="row">
                <h2>На сегодняшний<br>день Обои Центр - это</h2>
                <div class="col-5">
                    <ul>
                        <li>
                            <span class="ico">
                                <svg width="51" height="51" viewBox="0 0 51 51" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M24.5609 2.96241C25.1205 2.5542 25.8797 2.5542 26.4393 2.96241L31.5999 6.7268L37.9875 6.71464C38.6802 6.71332 39.2944 7.15958 39.5072 7.81878L41.4695 13.8976L46.6443 17.6423C47.2055 18.0484 47.4401 18.7704 47.2248 19.4288L45.2394 25.5L47.2248 31.5712C47.4401 32.2296 47.2055 32.9516 46.6443 33.3577L41.4695 37.1024L39.5072 43.1812C39.2944 43.8404 38.6802 44.2866 37.9875 44.2853L31.5999 44.2732L26.4393 48.0376C25.8797 48.4458 25.1205 48.4458 24.5609 48.0376L19.4003 44.2732L13.0127 44.2853C12.32 44.2866 11.7058 43.8404 11.493 43.1812L9.53065 37.1024L4.35582 33.3577C3.79465 32.9516 3.56004 32.2296 3.77534 31.5712L5.76079 25.5L3.77534 19.4288C3.56004 18.7704 3.79465 18.0484 4.35582 17.6423L9.53065 13.8976L11.493 7.81878C11.7058 7.15958 12.32 6.71332 13.0127 6.71464L19.4003 6.7268L24.5609 2.96241ZM25.5001 6.22271L20.8577 9.60913C20.5841 9.8087 20.2541 9.91593 19.9154 9.91529L14.1692 9.90435L12.4039 15.3728C12.2999 15.6951 12.0959 15.9758 11.8215 16.1743L7.16632 19.543L8.9524 25.0046C9.05767 25.3265 9.05767 25.6735 8.9524 25.9954L7.16632 31.457L11.8215 34.8257C12.0959 35.0242 12.2999 35.3049 12.4039 35.6272L14.1692 41.0956L19.9155 41.0848C20.2541 41.0841 20.5841 41.1913 20.8577 41.3909L25.5001 44.7773L30.1425 41.3909C30.4161 41.1913 30.7461 41.0841 31.0847 41.0848L36.831 41.0956L38.5963 35.6272C38.7003 35.3049 38.9043 35.0242 39.1786 34.8257L43.8339 31.457L42.0478 25.9954C41.9425 25.6735 41.9425 25.3265 42.0478 25.0046L43.8339 19.543L39.1786 16.1743C38.9043 15.9758 38.7003 15.6951 38.5963 15.3728L36.831 9.90435L31.0848 9.91529C30.7461 9.91593 30.4161 9.8087 30.1425 9.60913L25.5001 6.22271Z" fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M35.127 19.0605C35.7493 19.6829 35.7493 20.6921 35.127 21.3145L24.502 31.9395C23.8796 32.5618 22.8704 32.5618 22.248 31.9395L16.9355 26.627C16.3132 26.0046 16.3132 24.9954 16.9355 24.373C17.5579 23.7506 18.5671 23.7506 19.1895 24.373L23.375 28.5586L32.873 19.0605C33.4954 18.4382 34.5046 18.4382 35.127 19.0605Z" fill="white"/>
                                </svg>
                            </span>
                            Успешная работа на рынке
                        </li>
                        <li>
                            <span class="ico">
                                <svg width="47" height="47" viewBox="0 0 47 47" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M22.8435 2.60306C23.257 2.39631 23.7437 2.39631 24.1572 2.60306L43.7405 12.3947C44.2381 12.6435 44.5524 13.1521 44.5524 13.7084V33.2917C44.5524 33.8481 44.2381 34.3566 43.7405 34.6054L24.1572 44.3971C23.7437 44.6039 23.257 44.6039 22.8435 44.3971L3.26015 34.6054C2.76256 34.3566 2.44824 33.8481 2.44824 33.2917V13.7084C2.44824 13.1521 2.76256 12.6435 3.26015 12.3947L22.8435 2.60306ZM5.38574 14.6162V32.384L23.5003 41.4413L41.6149 32.384V14.6162L23.5003 5.55886L5.38574 14.6162Z" fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M2.60265 13.0515C2.96541 12.326 3.84765 12.0319 4.57318 12.3946L24.1565 22.1863C24.882 22.5491 25.1761 23.4313 24.8134 24.1568C24.4506 24.8824 23.5684 25.1765 22.8428 24.8137L3.25949 15.022C2.53396 14.6593 2.23988 13.777 2.60265 13.0515Z" fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M23.5 22.0312C24.3112 22.0312 24.9688 22.6888 24.9688 23.5V43.0833C24.9688 43.8945 24.3112 44.5521 23.5 44.5521C22.6888 44.5521 22.0312 43.8945 22.0312 43.0833V23.5C22.0312 22.6888 22.6888 22.0312 23.5 22.0312Z" fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M44.3973 13.0515C44.7601 13.777 44.466 14.6593 43.7405 15.022L24.1572 24.8137C23.4316 25.1765 22.5494 24.8824 22.1866 24.1568C21.8239 23.4313 22.1179 22.5491 22.8435 22.1863L42.4268 12.3946C43.1523 12.0319 44.0346 12.326 44.3973 13.0515Z" fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M34.6054 8.15573C34.9681 8.88126 34.674 9.7635 33.9485 10.1263L14.3652 19.9179C13.6396 20.2807 12.7574 19.9866 12.3946 19.2611C12.0319 18.5356 12.326 17.6533 13.0515 17.2906L32.6348 7.49889C33.3603 7.13612 34.2426 7.4302 34.6054 8.15573Z" fill="white"/>
                                </svg>
                            </span>
                            Бесплатная доставка товара
                        </li>
                        <li>
                            <span class="ico">
                                <svg width="46" height="46" viewBox="0 0 46 46" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M15.8125 9.58341C15.8125 7.73097 17.3142 6.22925 19.1667 6.22925H40.25C42.1025 6.22925 43.6042 7.73097 43.6042 9.58341V30.6667C43.6042 32.5192 42.1025 34.0209 40.25 34.0209H19.1667C17.3142 34.0209 15.8125 32.5192 15.8125 30.6667V9.58341ZM19.1667 9.10425C18.902 9.10425 18.6875 9.31876 18.6875 9.58341V30.6667C18.6875 30.9314 18.902 31.1459 19.1667 31.1459H40.25C40.5147 31.1459 40.7292 30.9314 40.7292 30.6667V9.58341C40.7292 9.31876 40.5147 9.10425 40.25 9.10425H19.1667Z" fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M9.56631 18.1105C9.83184 17.8654 10.18 17.7292 10.5413 17.7292H17.2497C18.0436 17.7292 18.6872 18.3728 18.6872 19.1667V32.5834C18.6872 33.3773 18.0436 34.0209 17.2497 34.0209H3.83301C3.0391 34.0209 2.39551 33.3773 2.39551 32.5834V25.359C2.39551 24.9578 2.56318 24.5749 2.85798 24.3027L9.56631 18.1105ZM11.1034 20.6042L5.27051 25.9884V31.1459H15.8122V20.6042H11.1034Z" fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M9.58301 33.0625C10.3769 33.0625 11.0205 33.7061 11.0205 34.5C11.0205 35.8231 12.0932 36.8958 13.4163 36.8958C14.7395 36.8958 15.8122 35.8231 15.8122 34.5C15.8122 33.7061 16.4558 33.0625 17.2497 33.0625C18.0436 33.0625 18.6872 33.7061 18.6872 34.5C18.6872 37.411 16.3273 39.7708 13.4163 39.7708C10.5054 39.7708 8.14551 37.411 8.14551 34.5C8.14551 33.7061 8.7891 33.0625 9.58301 33.0625Z" fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M30.667 33.0625C31.4609 33.0625 32.1045 33.7061 32.1045 34.5C32.1045 35.8231 33.1772 36.8958 34.5003 36.8958C35.8235 36.8958 36.8962 35.8231 36.8962 34.5C36.8962 33.7061 37.5397 33.0625 38.3337 33.0625C39.1276 33.0625 39.7712 33.7061 39.7712 34.5C39.7712 37.411 37.4113 39.7708 34.5003 39.7708C31.5894 39.7708 29.2295 37.411 29.2295 34.5C29.2295 33.7061 29.8731 33.0625 30.667 33.0625Z" fill="white"/>
                                </svg>
                            </span>
                            Налаженная логистика
                        </li>
                        <li>
                            <span class="ico">
                                <svg width="47" height="47" viewBox="0 0 47 47" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M11.0596 31.6528C11.2927 32.4298 10.8518 33.2486 10.0749 33.4817C8.37929 33.9903 7.11414 34.5669 6.30566 35.1403C5.45902 35.7408 5.38574 36.13 5.38574 36.2291C5.38574 36.3282 5.45904 36.7174 6.30566 37.3179C7.11414 37.8913 8.37929 38.4678 10.0749 38.9765C13.4473 39.9882 18.1943 40.6353 23.5003 40.6353C28.8064 40.6353 33.5534 39.9882 36.9258 38.9765C38.6214 38.4678 39.8865 37.8913 40.695 37.3179C41.5416 36.7174 41.6149 36.3282 41.6149 36.2291C41.6149 36.13 41.5416 35.7408 40.695 35.1403C39.8865 34.5669 38.6213 33.9903 36.9258 33.4817C36.1488 33.2486 35.7079 32.4298 35.941 31.6528C36.1741 30.8758 36.9929 30.435 37.7698 30.668C39.6182 31.2225 41.2209 31.912 42.3944 32.7443C43.5297 33.5495 44.5524 34.7058 44.5524 36.2291C44.5524 37.7523 43.5297 38.9086 42.3944 39.7139C41.221 40.5462 39.6182 41.2356 37.7699 41.7901C34.0545 42.9047 29.0099 43.5728 23.5003 43.5728C17.9908 43.5728 12.9461 42.9047 9.23077 41.7901C7.38246 41.2356 5.7797 40.5462 4.60623 39.7139C3.47092 38.9086 2.44824 37.7523 2.44824 36.2291C2.44824 34.7058 3.47093 33.5495 4.60623 32.7443C5.7797 31.912 7.38245 31.2225 9.23076 30.668C10.0077 30.435 10.8265 30.8758 11.0596 31.6528Z" fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M9.30176 16.3343C9.30176 8.63103 15.6929 2.448 23.4997 2.448C31.3064 2.448 37.6976 8.63103 37.6976 16.3343C37.6976 21.7479 34.1546 26.5944 30.9187 29.9316C29.268 31.6341 27.6225 33.0198 26.3916 33.9792C25.7749 34.4599 25.2592 34.8359 24.8949 35.0937C24.7127 35.2226 24.5681 35.3221 24.4675 35.3904C24.4171 35.4246 24.3777 35.451 24.3501 35.4694L24.3176 35.4909L24.3081 35.4972L24.305 35.4992L24.304 35.4999C24.3035 35.5001 24.3032 35.5004 23.4997 34.2709C22.6962 35.5004 22.6958 35.5001 22.6954 35.4999L22.6943 35.4992L22.6913 35.4972L22.6818 35.4909L22.6492 35.4694C22.6216 35.451 22.5822 35.4246 22.5319 35.3904C22.4312 35.3221 22.2866 35.2226 22.1044 35.0937C21.7401 34.8359 21.2245 34.4599 20.6078 33.9792C19.3769 33.0198 17.7314 31.6341 16.0806 29.9316C12.8448 26.5944 9.30176 21.7479 9.30176 16.3343ZM23.4997 34.2709L22.6962 35.5004C23.1843 35.8194 23.815 35.8194 24.3032 35.5004L23.4997 34.2709ZM23.4997 32.4798C23.797 32.2643 24.1653 31.99 24.5857 31.6624C25.7415 30.7615 27.2783 29.4663 28.8098 27.8868C31.9385 24.6601 34.7601 20.5384 34.7601 16.3343C34.7601 10.3216 29.7532 5.3855 23.4997 5.3855C17.2462 5.3855 12.2393 10.3216 12.2393 16.3343C12.2393 20.5384 15.0608 24.6601 18.1895 27.8868C19.7211 29.4663 21.2579 30.7615 22.4137 31.6624C22.834 31.99 23.2024 32.2643 23.4997 32.4798Z" fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M17.1357 16.6458C17.1357 13.1308 19.9853 10.2812 23.5003 10.2812C27.0154 10.2812 29.8649 13.1308 29.8649 16.6458C29.8649 20.1609 27.0154 23.0104 23.5003 23.0104C19.9853 23.0104 17.1357 20.1609 17.1357 16.6458ZM23.5003 13.2188C21.6076 13.2188 20.0732 14.7531 20.0732 16.6458C20.0732 18.5385 21.6076 20.0729 23.5003 20.0729C25.393 20.0729 26.9274 18.5385 26.9274 16.6458C26.9274 14.7531 25.393 13.2188 23.5003 13.2188Z" fill="white"/>
                                </svg>
                            </span>
                            Отгрузка от одного рулона
                        </li>
                    </ul>
                </div>
                <div class="col-7">
                    <p><strong>Обои Центр</strong> - официальный дилер европейских и российских обойных фабрик с многолетним опытом работы на рынке настенных покрытий. Входим в тройку крупнейших игроков рынка России и занимаем лидирующие позиции среди оптовых поставщиков. Поставляем обои и краску по РФ. Мы предлагаем качественный сервис и постоянное наличие товара на складах. Обои Центр - это коллектив профессионалов и комьюнити единомышленников. Мы объединяем экспертов дизайна интерьера и предлагаем лучшие условия сотрудничества. Выбирая нас, вы выбираете партнера с многолетним опытом работы.</p>
                </div>
            </div>
        </div>
    </section>
    @if(!empty($reviews))
        <section class="yandex-reviews">
            <div class="container">
                <h3 class="text-center">Отзывы о нашей<br>деятельности</h3>
                <div class="reviews-wrapper">
                    <div class="reviews-slider">
                        <div class="swiper reviews-swiper">
                            <div class="swiper-wrapper">
                                @foreach($reviews['reviews'] as $review)
                                    <div class="swiper-slide review-item">
                                        <div class="review-shadow">
                                            <div class="user">
                                                <div class="avatar">
                                                    @if(strpbrk($review['user_icon'], 'https'))
                                                        <img src="{{ $review['user_icon'] }}" alt="Аватар {{ $review['user_name'] }}">
                                                    @else
                                                        <div class="user-icon {{ $review['user_icon_class'] }}">{{ $review['user_icon'] }}</div>
                                                    @endif
                                                </div>
                                                <div class="user-info">
                                                    {{ $review['user_name'] }}<span>{{ $review['user_role'] }}</span>
                                                    <div class="rating-holder">
                                                        <div class="c-rating c-rating--regular" data-rating-value="{{ $review['rating'] }}">
                                                            <span>1</span>
                                                            <span>2</span>
                                                            <span>3</span>
                                                            <span>4</span>
                                                            <span>5</span>
                                                        </div>
                                                    </div>
                                                </div>
                                            </div>
                                            <div class="text">
                                                {{ $review['comment_text'] }}
                                            </div>
                                        </div>
                                    </div>
                                @endforeach
                            </div>
                        </div>
                    </div>
                    <div class="swiper-pagination"></div>
                    <div class="review-button review-button-next">
                        <svg width="21" height="30" viewBox="0 0 21 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M1 29L19 15.8235L1 0.999998" stroke="white" stroke-width="2"/>
                        </svg>
                    </div>
                    <div class="review-button review-button-prev">
                        <svg width="21" height="30" viewBox="0 0 21 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M20 1L2 14.1765L20 29" stroke="white" stroke-width="2"/>
                        </svg>
                    </div>
                </div>
                <div class="d-flex justify-content-center align-items-center pt-5">
                    <a href="{{ $reviews['link'] }}" target="_blank" class="all-reviews btn btn-outline-dark text-uppercase">
                        Все отзывы
                        <svg xmlns="http://www.w3.org/2000/svg" width="38" height="9" viewBox="0 0 38 9" fill="none">
                            <path d="M37.3536 4.85355C37.5488 4.65829 37.5488 4.34171 37.3536 4.14645L34.1716 0.964466C33.9763 0.769204 33.6597 0.769204 33.4645 0.964466C33.2692 1.15973 33.2692 1.47631 33.4645 1.67157L36.2929 4.5L33.4645 7.32843C33.2692 7.52369 33.2692 7.84027 33.4645 8.03553C33.6597 8.2308 33.9763 8.2308 34.1716 8.03553L37.3536 4.85355ZM0 5H37V4H0V5Z" fill="black"/>
                        </svg>
                    </a>
                </div>
            </div>
        </section>
    @endif
@endsection
